/** 
 * @copyright Copyright (c) 2025, AnBr75 and/or its affiliates. All rights reserved.
 * @author AnBr75
 * @name chess_board_0x88.js
 * @version created 27.09m.2025 
 * last modified 27.09m.2025
*/

/**
 * НАЗНАЧЕНИЕ
 * Используем доску 0x88. Размер 128.
 * 0,   1,   2,   3,   4,   5,   6,   7,   8,   9,   10,  11,  12,  13,  14,  15,
 * 16,  17,  18,  19,  20,  21,  22,  23,  24,  25,  26,  27,  28,  29,  30,  31,
 * 32,  33,  34,  35,  36,  37,  38,  39,  40,  41,  42,  43,  44,  45,  46,  47,
 * 48,  49,  50,  51,  52,  53,  54,  55,  56,  57,  58,  59,  60,  61,  62,  63,
 * 64,  65,  66,  67,  68,  69,  70,  71,  72,  73,  74,  75,  76,  77,  78,  79,
 * 80,  81,  82,  83,  84,  85,  86,  87,  88,  89,  90,  91,  92,  93,  94,  95,
 * 96,  97,  98,  99,  100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111,
 * 112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127
 * 
 * Что бы не делать много работы для проверки выхода за пределы доски
 * делаем только одну операцию проверяем SquareIndex & 0x88 == 0 если
 * равно 0 значит мы на доске, иначе вышли за пределы. 
 * Для этого и нужна такая доска.
 * Например:
 * 7 & 0x88 = 0
 * 8 & 0x88 = 8
 * 10 & 0x88 = 8
 * 18 & 0x88 = 0
 * 
 * Перевод координат доски ху в линейную: 
 * s_0x88 = 16 * y_07 + x_07;
 * И обратно:
 * x_07 = s_0x88 & 7;
 * y_07 = s_0x88 >> 4; // s_0x88 / 16
*/

class Chess_board_0x88_C {

    static NAME = "Chess_board_0x88_C";

    static BLACK = 0;
    static WHITE = 1;

    static PIECE_NO = 0; // нет фигуры
    static PAWN = 1;     // пешка 
    static KNIGHT = 2;   // конь
    static BISHOP = 3;   // слон
    static ROOK = 4;     // ладья
    static QUEEN = 5;    // ферзь
    static KING = 6;     // король

    static PIECE_NAME = [
        "PIECE_NO", "PAWN", "KNIGHT", "BISHOP", "ROOK", "QUEEN", "KING"
    ];

    // letter coordinate
    static LET_COOR = [
        "a", "b", "c", "d", "e", "f", "g", "h"
    ];

    sq_piece_0x88 = new Array(128).fill(0);// доска 0x88 с фигурами
    sq_piece_color_0x88 = new Array(128).fill(-1);// доска 0x88 с цветом фигур

    // ВСПОМОГАТЕЛЬНАЯ ИНФОРМАЦИЯ
    // цвет хода 0 - черные 1 - белые
    side_to_move = 0;

    // разрешение взятия на проходе 1/0
    en_passant_yes = 0;

    // координата битого поля
    en_passant_target_square = 0;

    // рокировка белых в длинную сторону   1/0
    castling_Q = 1;

    // рокировка белых в короткую сторону  1/0
    castling_K = 1;

    // рокировка черных в длинную сторону  1/0
    castling_q = 1;

    // рокировка черных в короткую сторону 1/0
    castling_k = 1;

    // оценка позиции
    //eval = 0;

    // 64 битный хеш-ключ позиции
    //hash_key = 1n;

    //hash_key_index = 0;// индекс в таблице перестановок
    //hash_key_lock = 0;// ключ в таблице перестановок





    constructor() {
    }

    iniM() {

        this.iniStartPosition();

    }

    // переводим координаты х и у в линейную координату доски 128(0x88)
    x07_y07_to_0x88(x07, y07) {//rank07, file07
        let s_0x88 = 16 * y07 + x07;
        return s_0x88;
    }

    // переводим линейную координату доски 128(0x88) в х
    s_0x88_to_x07(s_0x88) {//rank07, file07
        let x07 = s_0x88 & 7;
        return x07;
    }

    // переводим линейную координату доски 128(0x88) в у
    s_0x88_to_y07(s_0x88) {//rank07, file07
        let y07 = s_0x88 >> 4; // s_0x88 / 16    
        return y07;
    }

    // рисуем доску на консоле браузера (для тестирования)
    drow0x88() {
        console.log("drow");
        let l = 0;// только один раз должен сработать перевод строки
        let line = "";//

        console.log( "------------------------------------------------");

        for (let i = 0; i < 128; i++) {
            if ((i & 136) == 0) {// 136 0x88
                l = 1;
                //line = line + "|" + String(this.squares_0x88[i]);
                line = line + "|" + String(this.sq_piece_0x88[i]);
                // line = line + "|" + String(this.sq_piece_0x88[i] + ":" + this.s_0x88_to_y07(i) + ":" 
                // + this.s_0x88_to_x07(i) + ":" + i );
            } else if (l == 1) {
                l = 0;
                console.log(line);
                //console.log( "\n");
                line = "";
            }
        }
        console.log("side_to_move = " + this.side_to_move);
    }

   // рисуем доску на консоле браузера (для тестирования)
    drow0x88_color() {
        console.log("drow");
        let l = 0;// только один раз должен сработать перевод строки
        let line = "";//

        for (let i = 0; i < 128; i++) {
            if ((i & 136) == 0) {// 136 0x88
                l = 1;
                //line = line + "|" + String(this.squares_0x88[i]);
                line = line + "|" + String(this.sq_piece_color_0x88[i]);
                // line = line + "|" + String(this.sq_piece_0x88[i] + ":" + this.s_0x88_to_y07(i) + ":" 
                // + this.s_0x88_to_x07(i) + ":" + i );
            } else if (l == 1) {
                l = 0;
                console.log(line);
                //console.log( "\n");
                line = "";
            }
        }
    }

    drow0x88_2() {
        console.log("drow");
        let line = "";//
        for (let i = 0; i < 128; i++) {
            //line = line + String(this.squares_0x88[i]) + ",";
            line = line + String(this.sq_piece_0x88[i]) + ",";
        }
        console.log(line);
    }

    // инициализируем одномерную доску движка из двумерной доски оболочки
    ini_0x88_from_8x8(chessBoard_8x8_O) {
        console.log("ini_0x88_from_8x8");
        let i = -1;

        this.iniStartPosition();
        for (let y = 0; y < 8; y++) {
            for (let x = 0; x < 8; x++) {
                i = this.x07_y07_to_0x88(x, y);
                this.sq_piece_0x88[i] = chessBoard_8x8_O.squares_p_8x8[y][x];
                this.sq_piece_color_0x88[i] = chessBoard_8x8_O.squares_pc_8x8[y][x];
            }
        }
        // цвет хода 0 - черные 1 - белые
        this.side_to_move = chessBoard_8x8_O.side_to_move;
        // разрешение взятия на проходе 1/0
        this.en_passant_yes = chessBoard_8x8_O.en_passant_yes;
        // координата битого поля
        this.en_passant_target_square = chessBoard_8x8_O.en_passant_target_square;
        // рокировка белых в длинную сторону   1/0
        this.castling_Q = chessBoard_8x8_O.castling_Q;
        // рокировка белых в короткую сторону  1/0
        this.castling_K = chessBoard_8x8_O.castling_K;
        // рокировка черных в длинную сторону  1/0
        this.castling_q = chessBoard_8x8_O.castling_q;
        // рокировка черных в короткую сторону 1/0
        this.castling_k = chessBoard_8x8_O.castling_k;


    }



    //
    iniStartPosition() {

        /*
         имя фигуры
         0 - нет фигуры
         1 - пешка 
         2 - конь 
         3 - слон
         4 - ладья 
         5 - ферзь 
         6 - король
        */
        // раставляем фигуры
        this.sq_piece_0x88 = [
            4, 2, 3, 5, 6, 3, 2, 4, 0, 0, 0, 0, 0, 0, 0, 0,
            1, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0,
            0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
            0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
            0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
            0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
            1, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0,
            4, 2, 3, 5, 6, 3, 2, 4, 0, 0, 0, 0, 0, 0, 0, 0,
        ];

        // инициируем цвет фигур
        this.sq_piece_color_0x88 = [
            0, 0, 0, 0, 0, 0, 0, 0, -1, -1, -1, -1, -1, -1, -1, -1,
            0, 0, 0, 0, 0, 0, 0, 0, -1, -1, -1, -1, -1, -1, -1, -1,
            -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1,
            -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1,
            -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1,
            -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1,
            1, 1, 1, 1, 1, 1, 1, 1, -1, -1, -1, -1, -1, -1, -1, -1,
            1, 1, 1, 1, 1, 1, 1, 1, -1, -1, -1, -1, -1, -1, -1, -1
        ];

        // цвет хода 0 - черные 1 - белые
        this.side_to_move = 1;
        // разрешение взятия на проходе 1/0
        this.en_passant_yes = 0;
        // координата битого поля
        this.en_passant_target_square = 0;
        // рокировка белых в длинную сторону   1/0
        this.castling_Q = 1;
        // рокировка белых в короткую сторону  1/0
        this.castling_K = 1;
        // рокировка черных в длинную сторону  1/0
        this.castling_q = 1;
        // рокировка черных в короткую сторону 1/0
        this.castling_k = 1;
        // 64 битный хеш-ключ позиции
        this.hash_key = 1n;
        this.hash_key_index = 0;// индекс в таблице перестановок
        this.hash_key_lock = 0;// ключ в таблице перестановок
        // оценка позиции
        this.eval = 0;
    }
}

/*

    squares_64 = new Array(64);// обычная доска в одномерном массиве 64 ячейки
    squares_0x88 = new Array(128);// доска 0x88 размером 128 ячейки

    squares_64_to_128 = new Array(64);// перевод координаты 64 в 128 доску

    squares_64_to_x = new Array(64);// перевод координаты ячейки в горизонтальную
    squares_64_to_y = new Array(64);// перевод координаты ячейки в вертикальную
    squares_64_to_x_an = new Array(64);// перевод координаты ячейки в горизонтальную аннотацию (a,b,c,d,e,f,g,h)


        //пронумерованные поля доски 0x88
        this.squares_0x88 = [
            0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15,
            16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31,
            32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47,
            48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63,
            64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79,
            80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95,
            96, 97, 98, 99, 100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111,
            112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127
        ];

        this.squares_64_to_128 = [
            0, 1, 2, 3, 4, 5, 6, 7,
            16, 17, 18, 19, 20, 21, 22, 23,
            32, 33, 34, 35, 36, 37, 38, 39,
            48, 49, 50, 51, 52, 53, 54, 55,
            64, 65, 66, 67, 68, 69, 70, 71,
            80, 81, 82, 83, 84, 85, 86, 87,
            96, 97, 98, 99, 100, 101, 102, 103,
            112, 113, 114, 115, 116, 117, 118, 119
        ];


        this.squares_64 = [
            0, 1, 2, 3, 4, 5, 6, 7,
            8, 9, 10, 11, 12, 13, 14, 15,
            16, 17, 18, 19, 20, 21, 22, 23,
            24, 25, 26, 27, 28, 29, 30, 31,
            32, 33, 34, 35, 36, 37, 38, 39,
            40, 41, 42, 43, 44, 45, 46, 47,
            48, 49, 50, 51, 52, 53, 54, 55,
            56, 57, 58, 59, 60, 61, 62, 63
        ];



        this.squares_64_to_x = [
            1, 2, 3, 4, 5, 6, 7, 8,
            1, 2, 3, 4, 5, 6, 7, 8,
            1, 2, 3, 4, 5, 6, 7, 8,
            1, 2, 3, 4, 5, 6, 7, 8,
            1, 2, 3, 4, 5, 6, 7, 8,
            1, 2, 3, 4, 5, 6, 7, 8,
            1, 2, 3, 4, 5, 6, 7, 8,
            1, 2, 3, 4, 5, 6, 7, 8,
        ];

        this.squares_64_to_y = [
            8, 8, 8, 8, 8, 8, 8, 8,
            7, 7, 7, 7, 7, 7, 7, 7,
            6, 6, 6, 6, 6, 6, 6, 6,
            5, 5, 5, 5, 5, 5, 5, 5,
            4, 4, 4, 4, 4, 4, 4, 4,
            3, 3, 3, 3, 3, 3, 3, 3,
            2, 2, 2, 2, 2, 2, 2, 2,
            1, 1, 1, 1, 1, 1, 1, 1
        ];

        this.squares_64_to_x_an = [
            "a", "b", "c", "d", "e", "f", "g", "h",
            "a", "b", "c", "d", "e", "f", "g", "h",
            "a", "b", "c", "d", "e", "f", "g", "h",
            "a", "b", "c", "d", "e", "f", "g", "h",
            "a", "b", "c", "d", "e", "f", "g", "h",
            "a", "b", "c", "d", "e", "f", "g", "h",
            "a", "b", "c", "d", "e", "f", "g", "h",
            "a", "b", "c", "d", "e", "f", "g", "h",
        ];


       this.squares64 = [
            0,  1,  2,  3,  4,  5,  6,  7,
            8,  9,  10, 11, 12, 13, 14, 15,
            16, 17, 18, 19, 20, 21, 22, 23,
            24, 25, 26, 27, 28, 29, 30, 31,
            32, 33, 34, 35, 36, 37, 38, 39,
            40, 41, 42, 43, 44, 45, 46, 47,
            48, 49, 50, 51, 52, 53, 54, 55,
            56, 57, 58, 59, 60, 61, 62, 63
        ];


        this.squares128 = [
            0,   1,   2,   3,   4,   5,   6,   7,   8,   9,   10,  11,  12,  13,  14,  15,
            16,  17,  18,  19,  20,  21,  22,  23,  24,  25,  26,  27,  28,  29,  30,  31,
            32,  33,  34,  35,  36,  37,  38,  39,  40,  41,  42,  43,  44,  45,  46,  47,
            48,  49,  50,  51,  52,  53,  54,  55,  56,  57,  58,  59,  60,  61,  62,  63,
            64,  65,  66,  67,  68,  69,  70,  71,  72,  73,  74,  75,  76,  77,  78,  79,
            80,  81,  82,  83,  84,  85,  86,  87,  88,  89,  90,  91,  92,  93,  94,  95,
            96,  97,  98,  99,  100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111,
            112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127
        ];


        this.squares_64_to_128 = [
            0,   1,   2,   3,   4,   5,   6,   7, 
            16,  17,  18,  19,  20,  21,  22,  23, 
            32,  33,  34,  35,  36,  37,  38,  39,
            48,  49,  50,  51,  52,  53,  54,  55, 
            64,  65,  66,  67,  68,  69,  70,  71, 
            80,  81,  82,  83,  84,  85,  86,  87, 
            96,  97,  98,  99,  100, 101, 102, 103, 
            112, 113, 114, 115, 116, 117, 118, 119
        ];

        this.squares_64_to_x = [
            1, 2, 3, 4, 5, 6, 7, 8,
            1, 2, 3, 4, 5, 6, 7, 8,
            1, 2, 3, 4, 5, 6, 7, 8,
            1, 2, 3, 4, 5, 6, 7, 8,
            1, 2, 3, 4, 5, 6, 7, 8,
            1, 2, 3, 4, 5, 6, 7, 8,
            1, 2, 3, 4, 5, 6, 7, 8,
            1, 2, 3, 4, 5, 6, 7, 8,
        ];

        this.squares_64_to_y = [
            8, 8, 8, 8, 8, 8, 8, 8,
            7, 7, 7, 7, 7, 7, 7, 7,
            6, 6, 6, 6, 6, 6, 6, 6,
            5, 5, 5, 5, 5, 5, 5, 5,
            4, 4, 4, 4, 4, 4, 4, 4,
            3, 3, 3, 3, 3, 3, 3, 3,
            2, 2, 2, 2, 2, 2, 2, 2,
            1, 1, 1, 1, 1, 1, 1, 1
        ];

        this.squares_64_to_x_an = [
            "a", "b", "c", "d", "e", "f", "g", "h",
            "a", "b", "c", "d", "e", "f", "g", "h",
            "a", "b", "c", "d", "e", "f", "g", "h",
            "a", "b", "c", "d", "e", "f", "g", "h",
            "a", "b", "c", "d", "e", "f", "g", "h",
            "a", "b", "c", "d", "e", "f", "g", "h",
            "a", "b", "c", "d", "e", "f", "g", "h",
            "a", "b", "c", "d", "e", "f", "g", "h",
        ];
*/